Revit 2017 API
OccupancyUnit Enumeration
An enumerated type listing the occupancy unit of measure for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum OccupancyUnit
Visual Basic
Public Enumeration OccupancyUnit
Visual C++
public enum class OccupancyUnit
Members
Member name | Description
UseDefaultValues | OccupancyUnit is UseDefaultValues.
NumberOfPeople | OccupancyUnit is NumberOfPeople.
AreaPerPerson | OccupancyUnit is AreaPerPerson.
See Also
Autodesk.Revit.DB.Mechanical Namespace